Jackhenry/Configs/ci-jackhenry-create_loan.json

{
    "validation_spec": "{}",
    "request_body_spec": "{\n    AccountId: {\n        AcctId: (.loan_number // \"\"),\n        AcctType: \"L\"\n    },\n    LnAdd: {\n        LnInfoRec: {\n            Term: {\n            TermCnt: (.loan_approval.approved_term // \"\"),\n            TermUnits: \"Months\"\n            },\n            PmtTerm: \"001\",\n            PmtDayOfMonth:( if (\n                (.loan_approval.approved_first_payment_date | split(\"-\")[2] == \"29\")\n                or (.loan_approval.approved_first_payment_date | split(\"-\")[2] == \"30\")\n                or (.loan_approval.approved_first_payment_date | split(\"-\")[2] == \"31\")\n                ) then \n                    (.loan_approval.approved_first_payment_date) \n                else null \n                end\n            ),\n            PmtCode: (\n                ((.pricing_details[] \n                | select(.term_position == \"term_1\")\n                | $repaymentTypeMapping[.repayment_type]) // null)\n            ),\n            PmtAmt: (\n                (.loan_interfaces[] \n                | select(.is_latest==true and .interface_type==\"sherman\") \n                |(\n                    (.details.outLOAN_BUILDER.AmTable.AmLine[] \n                    | select(.Idx==\"1\")) | .Pmt | tonumber // null)\n                )\n            ),\n            PIAmt: (\n                (.loan_interfaces[] \n                | select(.is_latest==true and .interface_type==\"sherman\") \n                |(\n                    (.details.outLOAN_BUILDER.AmTable.AmLine[] \n                    | select(.Idx==\"1\")) | .Pmt | tonumber // null)\n                )\n            ),\n            OrigBal: (.approved_amount // \"\"),\n            OpenDt: (now | strftime(\"%Y-%m-%d\")),\n            OffCode: \"JHA\",\n            NxtSchedPmtDt: (.loan_approval.approved_first_payment_date // \"\"),\n            MatDt: (.maturity_date // \"\"),\n            IntRate: (.loan_approval.approved_rate/100 // \"\"),\n            IntBasis: ($accuralMapping[.accrual_method | tostring] // null),\n            BrCode: \"51\",\n            ProdCode: \"26\",\n            AcctStat: \"4\",\n            CustId: (.loan_relations[] | select(.is_primary_borrower == true) | .external_customer_id // \"\")\n        },\n        LnAcctInfo: {\n            PurpCode: \"98\",\n            CrRatingCode: \"5\",\n            CollatCode: \"14\",\n            NumBorw: (([.loan_relations[] | select(.relation_type == \"borrower\")] | length) // null),\n        },\n        LnBalDtInfo: {\n            OrigMatDt: (.maturity_date // \"\"),\n            FirstPmtDt: (.loan_approval.approved_first_payment_date // \"\"),\n            BalDueAtMat: \"True\"\n        },\n        LnDlrInfo: {\n            FrftDiscAtPayoff: \"R\"\n        },\n        LnPmtInfo: {\n            PostSeq5Code: \"Escrow\",\n            PostSeq4Code: \"Other charge\",\n            PostSeq3Code: \"Late charge\",\n            PostSeq2Code: \"Principal\",\n            PostSeq1Code: \"Interest\",\n            IgnrLateChgMulti: \"LateChg\",\n            BilLeadDays: \"15\",\n            BallPmtAmt: \"0\",\n            PostPmtPrePaidCode: \"Y\",\n            PostPrincCurtCode: \"N\"\n        },\n        LnRateInfo: {\n            RateVar: ((.pricing_details[] | select(.term_position == \"term_1\") | .differential_rate) // null),\n            RateFlr: (.min_rate // null),\n            RateCeil: (.max_rate // null),\n            MatRate: \"0\"\n        },\n        LnRealEstateInfo: {\n            PropState: (\n                ([.loan_relations[] | \n                select(.is_primary_borrower == true and( (.collaterals | length) > 0))\n                | .collaterals[0]\n                | .collateral_addresses[0]\n                | .state][0] // null)\n            ),\n            PropPostalCode: (\n                ([.loan_relations[]\n                | select(.is_primary_borrower == true and (.collaterals | length) > 0)\n                | .collaterals[0]\n                | .collateral_addresses[0]\n                | .zip_code][0] // null)\n            ),\n            PropCity: (\n                ([.loan_relations[]\n                | select(.is_primary_borrower == true and (.collaterals | length) > 0)\n                | .collaterals[0]\n                | .collateral_addresses[0]\n                | .city][0] // null)\n            ),\n            ApprVal: (\n                ([.loan_relations[] \n                | select(.is_primary_borrower == true and (.collaterals | length) > 0)\n                | .collaterals[0]\n                | .collateral_appraisal.details.report_price][0] // null)\n            )\n        },\n        LnRegRptInfo: {\n            NAICSCode: (.account_naics_code // null),\n            CallRptCode: \"4A\",\n            Req1098: \"N\",\n            SBAGuarPct: (.sba_express_details.sba_guaranty_percent // null),\n            SBAGuarId: (.sba_number // null),\n            SBABasisPts: (if (.approved_amount <= 150000) then 1.50 else 3.00 end // null)\n        }\n    }\n}",
    "response_body_spec": "{ \n apiSuccess: .apiSuccess,\n errors: { \n errorNum: (if (.errors.errorNum != \"\" and .errors.errorNum != null) then .errors.errorNum else null end),\n errorMsg: ((if (.errors.errorNum != \"\" and .errors.errorNum != null) then .errors.errorMsg.Error else null end)) \n },\n responses: (if .apiSuccess == true and .responses.Id then [\n { \n status: .responses.Id \n }\n ] else [] end)\n}",
    "request_body_spec_config": "{\n \"repaymentTypeMapping\": {\n \"principal_and_interest\": 0,\n \"interest_only\": 1\n },\n \"accuralMapping\": {\n \"310\": 1,\n \"320\": 0,\n \"201\": 3\n }\n}",
    "response_body_spec_config": "{}",
    "xml_error_path": "s:Envelope/s:Body/s:Fault/detail/HdrFault/FaultRecInfoArray/FaultMsgRec/ErrDesc",
    "xml_success_path": "s:Envelope/s:Body/LnAppRgtrAddResponse/LnAppId",
    "xsd_name": "TPG_DepositMaster",
    "xml_template": "<SOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\"\n xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"\n xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\">\n <SOAP-ENV:Header>\n <wsse:Security xmlns:wsse=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd\"\n xmlns:wsu=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd\">\n <wsse:UsernameToken xmlns:wsse=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd\">\n <wsse:Username>{{XUserName}}</wsse:Username>\n <wsse:Password Type=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText\">{{XPassword}}</wsse:Password>\n <wsu:Created xmlns:wsu=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd\">{{current_timestamp}}</wsu:Created>\n </wsse:UsernameToken>\n </wsse:Security>\n </SOAP-ENV:Header>\n <SOAP-ENV:Body>\n <AcctAdd xmlns=\"http://jackhenry.com/jxchange/TPG/2008\">\n <MsgRqHdr>\n <jXchangeHdr>\n <JxVer/>\n <AuditUsrId>{{XAuditUser}}</AuditUsrId>\n <AuditWsId>{{XAuditWorkStation}}</AuditWsId>\n <AuthenUsrId/>\n <ConsumerName/>\n <ConsumerProd/>\n <Ver_1/>\n <jXLogTrackingId>{{jXLogTrackingId}}</jXLogTrackingId>\n <Ver_2/>\n <InstRtId>{{XInstitutionRoutingID}}</InstRtId>\n <InstEnv>{{XEnvironment}}</InstEnv>\n <Ver_3/>\n <BusCorrelId>{{guid}}</BusCorrelId>\n <Ver_4/>\n <WorkflowCorrelId/>\n <Ver_5/>\n <ValidConsmName>{{XValidConsumerName}}</ValidConsmName>\n <ValidConsmProd>{{XValidConsumerProduct}}</ValidConsmProd>\n <Ver_6/>\n </jXchangeHdr>\n <Ver_1/>\n <Ver_2/>\n <Ver_3/>\n </MsgRqHdr>\n <ErrOvrRdInfoArray>\n <ErrOvrRd>\n <ErrCode/>\n <Ver_1/>\n <BusSvcType/>\n <Ver_2/>\n </ErrOvrRd>\n <ErrOvrRd>\n <ErrCode/>\n <Ver_1/>\n <BusSvcType/>\n <Ver_2/>\n </ErrOvrRd>\n </ErrOvrRdInfoArray>\n <AccountId>\n <AcctId>{{ AccountId.AcctId }}</AcctId>\n <AcctType>{{ AccountId.AcctType }}</AcctType>\n </AccountId>\n <Ver_1/>\n <Ver_2/>\n <LnAdd>\n <LnInfoRec>\n <Term>\n <TermCnt>{{ LnAdd.LnInfoRec.Term.TermCnt }}</TermCnt>\n <TermUnits>{{ LnAdd.LnInfoRec.Term.TermUnits }}</TermUnits>\n </Term>\n <PmtTerm>{{ LnAdd.LnInfoRec.PmtTerm }}</PmtTerm>\n <PmtDayOfMonth>{{ LnAdd.LnInfoRec.PmtDayOfMonth }}</PmtDayOfMonth>\n <PmtCode>{{ LnAdd.LnInfoRec.PmtCode }}</PmtCode>\n <PmtAmt>{{ LnAdd.LnInfoRec.PmtAmt }}</PmtAmt>\n <PIAmt>{{ LnAdd.LnInfoRec.PIAmt }}</PIAmt>\n <OrigBal>{{ LnAdd.LnInfoRec.OrigBal }}</OrigBal>\n <OpenDt>{{ LnAdd.LnInfoRec.OpenDt }}</OpenDt>\n <OffCode>{{ LnAdd.LnInfoRec.OffCode }}</OffCode>\n <NxtSchedPmtDt>{{ LnAdd.LnInfoRec.NxtSchedPmtDt }}</NxtSchedPmtDt>\n <MatDt>{{ LnAdd.LnInfoRec.MatDt }}</MatDt>\n <IntRate>{{ LnAdd.LnInfoRec.IntRate }}</IntRate>\n <IntBasis>{{ LnAdd.LnInfoRec.IntBasis }}</IntBasis>\n <BrCode>{{ LnAdd.LnInfoRec.BrCode }}</BrCode>\n <ProdCode>{{ LnAdd.LnInfoRec.ProdCode }}</ProdCode>\n <AcctStat>{{ LnAdd.LnInfoRec.AcctStat }}</AcctStat>\n <Ver_1/>\n <CustId>{{ LnAdd.LnInfoRec.CustId }}</CustId>\n </LnInfoRec>\n <LnAcctInfo>\n <PurpCode>{{ LnAdd.LnAcctInfo.PurpCode }}</PurpCode>\n <CrRatingCode>{{ LnAdd.LnAcctInfo.CrRatingCode }}</CrRatingCode>\n <CollatCode>{{ LnAdd.LnAcctInfo.CollatCode }}</CollatCode>\n <Ver_1/>\n <NumBorw>{{ LnAdd.LnAcctInfo.NumBorw }}</NumBorw>\n </LnAcctInfo>\n <LnBalDtInfo>\n <OrigMatDt>{{ LnAdd.LnBalDtInfo.OrigMatDt }}</OrigMatDt>\n <FirstPmtDt>{{ LnAdd.LnBalDtInfo.FirstPmtDt }}</FirstPmtDt>\n <BalDueAtMat>{{ LnAdd.LnBalDtInfo.BalDueAtMat }}</BalDueAtMat>\n <Ver_1/>\n </LnBalDtInfo>\n <LnDlrInfo>\n <FrftDiscAtPayoff>{{ LnAdd.LnDlrInfo.FrftDiscAtPayoff }}</FrftDiscAtPayoff>\n </LnDlrInfo>\n <LnPmtInfo>\n <PostSeq5Code>{{ LnAdd.LnPmtInfo.PostSeq5Code }}</PostSeq5Code>\n <PostSeq4Code>{{ LnAdd.LnPmtInfo.PostSeq4Code }}</PostSeq4Code>\n <PostSeq3Code>{{ LnAdd.LnPmtInfo.PostSeq3Code }}</PostSeq3Code>\n <PostSeq2Code>{{ LnAdd.LnPmtInfo.PostSeq2Code }}</PostSeq2Code>\n <PostSeq1Code>{{ LnAdd.LnPmtInfo.PostSeq1Code }}</PostSeq1Code>\n <IgnrLateChgMulti>{{ LnAdd.LnPmtInfo.IgnrLateChgMulti }}</IgnrLateChgMulti>\n <BilLeadDays>{{ LnAdd.LnPmtInfo.BilLeadDays }}</BilLeadDays>\n <BallPmtAmt>{{ LnAdd.LnPmtInfo.BallPmtAmt }}</BallPmtAmt>\n <Ver_1/>\n <PostPmtPrePaidCode>{{ LnAdd.LnPmtInfo.PostPmtPrePaidCode }}</PostPmtPrePaidCode>\n <PostPrincCurtCode>{{ LnAdd.LnPmtInfo.PostPrincCurtCode }}</PostPrincCurtCode>\n <Ver_2/>\n </LnPmtInfo>\n <LnRateInfo>\n <RateVar>{{ LnAdd.LnRateInfo.RateVar }}</RateVar>\n <RateFlr>{{ LnAdd.LnRateInfo.RateFlr }}</RateFlr>\n <RateCeil>{{ LnAdd.LnRateInfo.RateCeil }}</RateCeil>\n <MatRate>{{ LnAdd.LnRateInfo.MatRate }}</MatRate>\n </LnRateInfo>\n <LnRealEstateInfo>\n <PropState>{{ LnAdd.LnRealEstateInfo.PropState }}</PropState>\n <PropPostalCode>{{ LnAdd.LnRealEstateInfo.PropPostalCode }}</PropPostalCode>\n <PropCity>{{ LnAdd.LnRealEstateInfo.PropCity }}</PropCity>\n <ApprVal>{{ LnAdd.LnRealEstateInfo.ApprVal }}</ApprVal>\n </LnRealEstateInfo>\n <LnRegRptInfo>\n <NAICSCode>{{ LnAdd.LnRegRptInfo.NAICSCode }}</NAICSCode>\n <CallRptCode>{{ LnAdd.LnRegRptInfo.CallRptCode }}</CallRptCode>\n <Req1098>{{ LnAdd.LnRegRptInfo.Req1098 }}</Req1098>\n <SBAGuarPct>{{ LnAdd.LnRegRptInfo.SBAGuarPct }}</SBAGuarPct>\n <SBAGuarId>{{ LnAdd.LnRegRptInfo.SBAGuarId }}</SBAGuarId>\n <SBABasisPts>{{ LnAdd.LnRegRptInfo.SBABasisPts }}</SBABasisPts>\n </LnRegRptInfo>\n </LnAdd>\n </AcctAdd>\n </SOAP-ENV:Body>\n</SOAP-ENV:Envelope>"
}